---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.KeySourceParam
source: html/0b79a475-0938-f39a-717d-f1058747f85a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.KeySourceParam Property

"Key Source"

## Syntax (C#)
```csharp
public static ForgeTypeId KeySourceParam { get; }
```